// Задача 0. Вывести квадрат числа.
//Tasks.Task0();
// Задача 1. По двум заданным числам проверять является ли первое квадратом второго.
//Tasks.Task1();
// Задача 2. Даны два числа. Показать большее и меньшее число.
//Tasks.Task2();
// Задача 3. По заданному номеру дня недели вывести его название.
//Tasks.Task3();
// Задача 4. Найти максимальное из трех чисел.
//Tasks.Task4();
// Задача 5. Написать программу вычисления значения функции y = sin(x).
//Tasks.Task5();
// Задача 6. Выяснить является ли число чётным.
//Tasks.Task6();
// Задача 7. Показать числа от -N до N.
//Tasks.Task7();
// Задача 8. Показать четные числа от 1 до N.
//Tasks.Task8();
// Задача 9. Показать последнюю цифру трёхзначного числа.
Tasks.Task9();